 
def solve(phrases: list):
    result = [] # список палиндромов
    for phrase in phrases: # пройдите циклом по всем фразам
        cleanphrase = phrase.replace(' ' , '') # сохраните фразу без пробелов
        if cleanphrase == cleanphrase[::-1]: # сравните фразу с ней же, развернутой наоборот (через [::-1])
            result.append(cleanphrase)
    return result

if __name__ == '__main__':
    # Этот код менять не нужно
    phrases = ["нажал кабан на баклажан", "дом как комод", "рвал дед лавр", "азот калий и лактоза",
               "а собака боса", "тонет енот", "карман мрак", "пуст суп"]
    result = solve(phrases)
    assert result == ["нажал кабан на баклажан", "рвал дед лавр", "азот калий и лактоза",
               "а собака боса", "тонет енот", "пуст суп"], f"Неверный результат: {result}"
    print(f"Палиндромы: {result}")